In [66]:
import warnings
warnings.filterwarnings('ignore')

%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
sns.set()


from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
from sklearn import metrics
from sklearn.naive_bayes import GaussianNB
from sklearn.impute import SimpleImputer
from sklearn.model_selection import cross_val_score
from sklearn.neighbors import KNeighborsClassifier

Откройте уже спарсенный и готовый для работы датасет «data.csv».

In [53]:
df = pd.read_csv("data.csv", encoding='Windows-1251')
df.head()

,job_title,hh_title,age,salary,exp. period,title of exp.
0,data analyst,Data analyst,22.0,NaN,2.67,Data Analyst
1,data analyst,Data Analyst,21.0,NaN,0.83,Junior Data Analyst
2,data analyst,Data Analyst,30.0,NaN,7.50,Data Analyst
3,data analyst,Data Analyst,24.0,NaN,4.92,Data Analyst
4,data analyst,Data Analyst,27.0,450000.0,3.25,Business Intelligence Analyst

Мы будем работать только со столбцами ['job_title', 'age', 'salary', 'exp. period']. Сохраните только их.

In [54]:
sdf = df.loc[:, ["job_title", "age", "salary", "exp. period"]]
sdf

        job_title   age    salary  exp. period
0    data analyst  22.0       NaN         2.67
1    data analyst  21.0       NaN         0.83
2    data analyst  30.0       NaN         7.50
3    data analyst  24.0       NaN         4.92
4    data analyst  27.0  450000.0         3.25
..            ...   ...       ...          ...
995           sql  51.0       NaN        25.42
996           sql  22.0       NaN         1.58
997           sql  42.0       NaN         9.33
998           sql   NaN       NaN        16.08
999           sql  19.0       NaN         0.33

[1000 rows x 4 columns]

In [55]:
sdf.isnull().sum ()

job_title        0
age             50
salary         706
exp. period      0
dtype: int64

In [56]:
sdf["age"] = sdf["age"].fillna(sdf.groupby("job_title")["age"].transform("last"))
sdf["salary"] = sdf["salary"].fillna(sdf.groupby("job_title")["salary"].transform("last"))
sdf

        job_title   age     salary  exp. period
0    data analyst  22.0   300000.0         2.67
1    data analyst  21.0   300000.0         0.83
2    data analyst  30.0   300000.0         7.50
3    data analyst  24.0   300000.0         4.92
4    data analyst  27.0   450000.0         3.25
..            ...   ...        ...          ...
995           sql  51.0  1505000.0        25.42
996           sql  22.0  1505000.0         1.58
997           sql  42.0  1505000.0         9.33
998           sql  19.0  1505000.0        16.08
999           sql  19.0  1505000.0         0.33

[1000 rows x 4 columns]

Создайте переменную Х, которая содержит данные датасета без столбца 'job_title'.

In [57]:
x = sdf.drop("job_title", axis=1)
x.head()

    age    salary  exp. period
0  22.0  300000.0         2.67
1  21.0  300000.0         0.83
2  30.0  300000.0         7.50
3  24.0  300000.0         4.92
4  27.0  450000.0         3.25

Создайте переменную y, которая содержит только данные столбца 'job_title'.

In [58]:
y = sdf["job_title"]
y

0      data analyst
1      data analyst
2      data analyst
3      data analyst
4      data analyst
           ...
995             sql
996             sql
997             sql
998             sql
999             sql
Name: job_title, Length: 1000, dtype: object

Разделите датасеты Х и у на тренировочные и тестовые, где train_size будет равен 80%. На забудьте
использовать функцию stratify.

In [59]:
xtrain, xtest, ytrain, ytest = train_test_split(x, y, test_size = 0.2, random_state = 1, stratify = y)

Обучите сначала модель с помощью алгоритма GaussianNB.

In [60]:
model = GaussianNB()
model.fit(xtrain, ytrain)

GaussianNB()

Протестируйте обученную модель на тестовых данных, и выведите на экран точность модели.

In [61]:
y_model = model.predict(xtest)

In [62]:
accuracy_score(ytest, y_model)

0.655

Используйте перекрестную проверку модели. Разбейте данные на десять групп и по очереди
используйте каждую из них для оценки обучения модели. Выведите на экран среднюю точность
модели.

In [64]:
score = cross_val_score(model, x, y, cv = 10)

In [65]:
score.mean()

0.645

Затем обучите модель с помощью алгоритма KNeighborsClassifier с количеством n_neighbors
равным 3.

In [68]:
modelK = KNeighborsClassifier(n_neighbors=3)
modelK.fit(xtrain, ytrain)

KNeighborsClassifier(n_neighbors=3)

Протестируйте обученную модель на тестовых данных, и выведите на экран точность модели.

In [69]:
y2_model = modelK.predict(xtest)

In [70]:
accuracy_score(ytest, y2_model)

0.97

Используйте перекрестную проверку модели. Разбейте данные на десять групп и по очереди
используйте каждую из них для оценки обучения модели. Выведите на экран среднюю точность
модели.

In [71]:
score = cross_val_score(modelK, x, y, cv = 10)

In [72]:
score.mean()

0.985